{
  "experiences": [
    {
      "brand": "WeRoad",
      "company": "WeRoad S.r.l.",
      "website": "https://www.weroad.com",
      "position": "Frontend Engineer",
      "startYear": 2024,
      "endYear": "Present",
      "description": "Contributed to the development of internal platforms used by travel coordinators and partners. Worked on migrating platforms to new technologies while keeping the same user experience and functionalities."
    },
    {
      "brand": "Kampaay",
      "company": "Kampaay S.r.l.",
      "website": "https://www.kampaay.com",
      "position": "Frontend Engineer",
      "startYear": 2023,
      "endYear": 2024,
      "description": "Built a platform for organizing corporate events easily and in an accessible way. Developed internal tools and panels to help employees manage events, customers and other data. Attended tech and product meetings and discussed engineering strategies. Contributed to defining development roadmaps by analysing tasks and issues, as well as finding the right solution for a specific problem."
    },
    {
      "brand": "EVNT Games",
      "company": "EVNT Games LLC",
      "website": "https://evnt.games",
      "position": "Frontend Engineer",
      "startYear": 2022,
      "endYear": 2024,
      "description": "Redesigned and created promotional and internal websites and tools for projects organized by Twitch and other leaders of the gaming and entertainment industry. Helped designing new pages and interfaces. Create an analytics and listing website and Overwolf app in a month to compete in the UEFN market.",
      "projects": ["EVNT", "MCL", "Lockout"]
    },
    {
      "brand": "Moonsworth",
      "company": "Moonsworth, LLC",
      "website": "https://www.moonsworth.com",
      "position": "Web Engineer",
      "startYear": 2021,
      "endYear": 2022,
      "description": "Maintained and created UI libraries for websites and a game launcher used by 100k+ users every day. Built new features and helped improve internal tools. Worked closely with designers and contributed to invent user interfaces using design tools like Figma. Deployed private packages to GitHub Packages Registry.",
      "projects": ["Moonsworth", "Lunar Client", "MCStats"]
    },
    {
      "brand": "Top.gg",
      "company": "Dbots BV",
      "website": "https://top.gg",
      "position": "Product Engineer",
      "startYear": 2020,
      "endYear": 2021,
      "description": "Redesigned and migrated an Express-based website to React, used by thousands of users every day. In charge of maintaining websites, internal web-based tools and UI component libraries. Attended meetings with designers to give feedback on the new interface while it was in the works."
    },
    {
      "brand": "Badlion",
      "company": "ESL FACEIT Group",
      "website": "https://eslfaceitgroup.com",
      "position": "Web Engineer",
      "startYear": 2020,
      "endYear": 2021,
      "description": "Redesigned a game launcher that's used by 50k+ users on a daily basis. Migrated the user interface to a completely new design system and integrated new features such as a client-side cheat detection software developed by ESEA. Also migrated various websites to Next and reorganized a monorepo containing a few projects."
    }
  ]
}
